# GetType

## Description
Returns the type index of the referenced screen object.

```pascal
FUNCTION GetType(h : HANDLE) : INTEGER;
```

```python

def vs.GetType(h):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Returns the node type of the referenced screen object. See GetTypeN.

## See Also
VS Functions:
GetTypeN

## Version
```diff
- GetType is obsolete as of Vectorworks 2011
```

Availability: from MiniCAD
## Category
* Object Info